app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
---
  def index
    @post = Post.all

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?
---
def update
  @post = Post.find(params[:id])
  if(@post.update(post_params))

INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)
---
  def create
    #render plain: params[:post].inspect
    @post = Post.new(post_params)

    if(@post.save)